#include <iostream>
#include <string>

using namespace std;

int main() {

	/*
	 * 0 0   - максимальное число
	 * 0 x - общий делитель x
	 * x 0 - общий делитель x
	 *
	 * x x
	 * x1 x2 кратное 1
	 * x1 x2 кратное 2
	 * x1 x2 кратное 3
	 * x1 x2 кратное 5
	 * x1 x2 кратное 7
	 * x1 x2 кратное 11
	 * x1 x2 кратное 13
	 * x1 x2 кратрое 17
	 * x1 x2 кратное 19
	 * x1 x2 кратное 23
	 * x1 x2 кратное 29
	 * x1 x2 кратное 31
	 * x1 x2 кратное 37
	 * x1 x2 кратное 41
	 * x1 x2 кратное 43
	 * x1 x2 кратное 47
	 * x1 x2 кратное 49
	 * x1 x2 кратное 51
	 * x1 x2 кратное 53
	 * x1 x2 кратное 59
	 * x1 x2 кратное 61
	 * x1 x2 кратное 67
	 * x1 x2 кратное 71
	 * x1 x2 кратное 73
	 * x1 x2 кратное 79
	 * x1 x2 кратное 83
	 * x1 x2 кратное 89
	 * x1 x2 кратное 97
	 *
	 *
	 *
	 *
	 */

	int a, b, x1, x2;
	cin >> a >> b;
	//a = 0;
	//b = 0;
	x1=a;
	x2=b;
	int n = 1;

	do {
		if(x1%2==0 && x2%2==0 && x1 !=0 && x2!=0){
			n = n*2;
			x1= a / 2;
			x2 = b / 2;

		}else if(x1%3==0 && x2%3==0 && x1!=0 && x2!=0){
					n = n*3;
					x1= a / 3;
					x2 = b / 3;
		}else if(x1%5==0 &&x2%5==0 && x1!=0 && x2!=0 ){
					n = n*5;
					x1= a / 5;
					x2 = b / 5;

		} else if(x1%7==0 && x2%7==0 && x1!=0 && x2!=0){
					n = n*7;
					x1= a / 7;
					x2 = b / 7;

		}else if(x1==x2 && x1!=0) {
					n = x1;

		}else if(x1 == 0 && x2!=0){
			n = x2;
		}else if(x2 == 0 && x1 !=0){
			n = x1;
		}else if( x1== 0 && x2 ==0){
			n = 2147483647;
		}else {
			break;
		}
		a = x1;
		b = x2;

	}while((x1%2==0 && x2%2==0 && x1!=0 && x2!=0) || (x1%3==0 && x2%3==0 && x1!=0 && x2!=0) || (x1%5==0 && x2%5==0 && x1!=0 && x2!=0) || (x1%7 == 0 && x2%7==0 && x1!=0 && x2!=0));
	cout << n;
	return 0;
}

